[
  {
    "id": "2",
    "title": "Talk on Computer Science Opportunities in Nepal at Magus Secondary School, Kirtipur",
    "descriptions": [
      "At Magus Secondary School in Kirtipur, we had an insightful session. We discussed the wealth of opportunities present in the field of computer science within Nepal. Furthermore, we provided an overview of CS club operations, covering key aspects to think about when establishing and running a club, along with strategies for implementing impactful initiatives within the school. A sincere thank you to all who contributed to the success of this event, and a special appreciation to Magus Secondary School."
    ],
    "date": "10th July 2023",
    "images": [
      "/assets/images/Events/Magus_Secondary_School/photo1.jpeg",
      "/assets/images/Events/Magus_Secondary_School/photo2.jpeg",
      "/assets/images/Events/Magus_Secondary_School/photo3.jpeg"
    ]
  },
  {
    "id": "3",
    "title": "Workshop on Computer Science Opportunities at Everest Boarding School, Kathmandu",
    "descriptions": [
      "CoSoG Nepal conducted an informative session at Everest Boarding School, Kathmandu. We discussed the wide array of opportunities within the field of computer science in Nepal. Additionally, we provided insights into the functioning of CS clubs, offering guidance on starting and structuring clubs effectively. We express gratitude to all who supported us in organizing this event."
    ],
    "date": "10th August 2023",
    "images": [
      "/assets/images/Events/Everest_boarding_school/photo1.jpeg",
      "/assets/images/Events/Everest_boarding_school/photo2.jpeg",
      "/assets/images/Events/Everest_boarding_school/photo3.jpeg"
    ]
  },
  {
    "id": "4",
    "title": "CoSoG Nepal at Constellation Secondary English Boarding School",
    "descriptions": [
      "It was a remarkable day at Constellation Secondary English Boarding School as CoSoG Nepal engaged with students in a discussion on the diverse prospects within the realm of Computer Science. Drawing from our of experience, we shared valuable insights from our past projects and shed light on the transformative role of CS clubs."
    ],
    "date": "28th August 2023",
    "images": [
      "/assets/images/Events/Constellation_Secondary_English_Boarding_School/photo1.jpeg",
      "/assets/images/Events/Constellation_Secondary_English_Boarding_School/photo2.jpg",
      "/assets/images/Events/Constellation_Secondary_English_Boarding_School/photo3.jpg"
    ]
  },
  {
    "id": "5",
    "title": "Seminar at Hathausa Little Star English Boarding School",
    "descriptions": [
      "We had an amazing day at Hathausa Little Star English Boarding School, where we discussed the various opportunities in the field of Computer Science. We also shared insights from our previous projects and CS club experiences."
    ],
    "date": "15th September 2023",
    "images": [
      "/assets/images/Events/Hathausa_Little_Star_English_Boarding_School/photo1.jpg",
      "/assets/images/Events/Hathausa_Little_Star_English_Boarding_School/photo2.jpg",
      "/assets/images/Events/Hathausa_Little_Star_English_Boarding_School/photo3.jpg"
    ]
  },
  {
    "id": "6",
    "title": "CoSoG Nepal at Skylark Secondary English Boarding School, Kapilvastu",
    "descriptions": [
      "We conducted an engaging session with the grade 8 and 9 students, where Aashish took the stage to discuss the various CS opportunities in Nepal. We had a blast dicussing how to form a CS club, how to organize events and sharing insights from our previous CS club experiences."
    ],
    "date": "25th September 2023",
    "images": [
      "/assets/images/Events/Skylark_Secondary_English_Boarding_School/photo1.jpg",
      "/assets/images/Events/Skylark_Secondary_English_Boarding_School/photo2.jpg",
      "/assets/images/Events/Skylark_Secondary_English_Boarding_School/photo3.jpg"
    ]
  },
  {
    "id": "7",
    "title": "Computer Science Seminar at Deep Boarding High School, Kathmandu",
    "descriptions": [
      "Our CoSoG Nepal team recently hosted an informative seminar at Deep Boarding High School in Kathmandu, where we talked about the ever-evolving field of technology, specifically computer science. We examined the wide range of opportunities available and discussed ways in which students can capitalize on them. Furthermore, we offered valuable insights into improving the school's CS culture, stressing the significance of CS clubs in nurturing interest and improving skills. We provided strategies for starting and managing CS clubs effectively, so that students can  engage actively with the CS community at their school. We express our sincere gratitude to all who contributed to the success of this event."
    ],
    "date": "3rd October 2023",
    "images": [
      "/assets/images/Events/Deep_Boarding_High_school/photo1.jpg",
      "/assets/images/Events/Deep_Boarding_High_school/photo2.jpg",
      "/assets/images/Events/Deep_Boarding_High_school/photo3.jpg"
    ]
  },
  {
    "id": "1",
    "title": "Presentation at Green Village English Boarding Secondary School",
    "descriptions": [
      "It was an exciting day at Green Village English Boarding Secondary School as CoSoG Nepal organized  a conversation on the wide range of career options in computer science. We shared a lot of lessons learned from our past initiatives and we shed light on the significant impact of CS clubs. Thank you to everyone involved!"
    ],
    "date": "17th June 2023",
    "images": [
      "/assets/images/Events/Green_Village_English_Boarding_school/photo1.jpeg",
      "/assets/images/Events/Green_Village_English_Boarding_school/photo2.jpeg",
      "/assets/images/Events/Green_Village_English_Boarding_school/photo3.jpeg"
    ]
  },
  {
    "id": "8",
    "title": "Opportunities in CS & Workings of CS Clubs: A Presentation at The Rolling Stones School",
    "descriptions": [
      "We recently hosted a seminar at The Rolling Stones School, where we talked about the exciting opportunities, abundant resources, and our mission to foster a thriving CS culture. Plus, we shared insights from our previous projects and CS club experiences."
    ],
    "date": "10th October 2023",
    "images": [
      "/assets/images/Events/The_Rolling_Stones_School/photo1.jpg",
      "/assets/images/Events/The_Rolling_Stones_School/photo2.jpg",
      "/assets/images/Events/The_Rolling_Stones_School/photo3.jpg"
    ]
  },
  {
    "id": "9",
    "title": "CoSoG Nepal at  LB Namuna Academy, Butwal.",
    "descriptions": [
      "We delved into exciting opportunities, abundant resources, and our mission to foster a thriving CS culture. Plus, we shared insights from our previous projects and CS club experiences."
    ],
    "date": "24th November 2023",
    "images": [
      "/assets/images/Events/LB_Namuna_Academy/photo1.jpg",
      "/assets/images/Events/LB_Namuna_Academy/photo2.jpg",
      "/assets/images/Events/LB_Namuna_Academy/photo3.jpg"
    ]
  },
  {
    "id": "10",
    "title": "CoSoG Nepal had an amazing day at Butwal Madina School, Butwal.",
    "descriptions": [
      "We took the stage to unfold the various opportunities in the field of Computer Science. Additionally, we discussed the hierarchy of a CS club, how to form a CS club, and how to organize events."
    ],
    "date": "28th November 2023",
    "images": [
      "/assets/images/Events/Butwal_Madina_School/photo1.jpg",
      "/assets/images/Events/Butwal_Madina_School/photo2.jpg",
      "/assets/images/Events/Butwal_Madina_School/photo3.jpg"
    ]
  },
  {
    "id": "11",
    "title": "CoSoG Nepal recently organized a mini-event at Gyanodaya Secondary School, Kathmandu.",
    "descriptions": [
      "We took the stage to unfold the myriad opportunities in the dynamic field of Computer Science💻 in Nepal. Furthermore, we discussed the hierarchy of a CS club, how to form a CS club, and how to organize events. We thank everyone who helped us organize this event, especially to all the students at Gyanodaya who gave their valuable time for this event."
    ],
    "date": "13th December 2023",
    "images": [
      "/assets/images/Events/Gyanodaya_Secondary_School/photo1.png",
      "/assets/images/Events/Gyanodaya_Secondary_School/photo2.png",
      "/assets/images/Events/Gyanodaya_Secondary_School/photo3.png"
    ]
  },
  {
    "id": "12",
    "title": "Computer Science in +2 (high school)",
    "descriptions": [
      "Computer Science in +2 program was a virtual career guidance program designed to help the SEE graduates make informed decision about their career by choosing right stream after 10th grade. We're successful to help over 75 students directly and many more through our recorded session.",
      "We laid out the differences between Computer Science in science and management stream; we explored different career paths within Computer Science; we explored the job and educational opportunities in Nepal and abroad, and discovered the boundless potential that awaits you in this ever-evolving landscape."
    ],
    "date": "4th May 2024",
    "images": [
      "/assets/images/Events/CS_in_high_school/CS_in_school1.jpg",
      "/assets/images/Events/CS_in_high_school/CS_in_school2.jpg",
      "/assets/images/Events/CS_in_high_school/CS_in_school3.jpg"
    ]
  },
  {
    "id": "13",
    "title": "CoSoG Nepal opened a CS Club at Annapurna Vidhya Mandir",
    "descriptions": [
      "On the 25th of June, 2024 Aashish Panthi, the vice-president of Cosog Nepal took the stage to discuss the opportunities in the field of Computer Science💻 in Nepal. Furthermore, he discussed the hierarchy of a CS club, how to form a CS club, and how to organize events.",
      "The session was concluded by forming a CS club at Shree Annapurna Vidhya Mandir Secondary School, Kapuwa Kapilvastu.",
      "The participation of 60+ students really motivated us to work more on this kind of project. We are so thankful to the school administration and all students."
    ],
    "date": "25th June 2024",
    "images": [
      "/assets/images/Events/Annapurna_Vidhya_Mandir/photo1.jpeg",
      "/assets/images/Events/Annapurna_Vidhya_Mandir/photo2.jpeg",
      "/assets/images/Events/Annapurna_Vidhya_Mandir/photo3.jpeg"
    ]
  },
  {
    "id": "14",
    "title": "Sharing Opportunities in Computer Science at Shree Mahendra Secondary School",
    "descriptions": [
      "During the session, students of grade 9, 10 and 11 were introduced to the opportunities in Computer Science. Also, they got familiar with the terms like Hackathons, Olympiads, Minutes, Proposals and many more. Mr. Aashish Panthi also shared how to form a CS club and how to organize events.",
      "Further, Aashish Panthi shared his journey and experiences in the field of Computer Science and motivated the students to take part in the upcoming events and competitions.",
      "The session was interactive and students were very enthusiastic to learn more about the field of Computer Science. We are thankful to the school administration and all the students of Shree Paanch Mahendra Secondary School, Kapuwa Kapilvastu for their active participation."
    ],
    "date": "26th June 2024",
    "images": [
      "/assets/images/Events/Mahendra_Secondary_School/photo1.jpeg",
      "/assets/images/Events/Mahendra_Secondary_School/photo2.jpeg",
      "/assets/images/Events/Mahendra_Secondary_School/photo3.jpeg"
    ]
  },
  {
    "id": "15",
    "title": "Opened new CS Club at Kapilvastu Gyanjyoti Shiksha Sadan",
    "descriptions": [
      "On the 26th of June, 2024 Aashish Panthi, the vice-president of Cosog Nepal shared the opportunities in the field of Computer Science in Nepal. Furthermore, he discussed the hierarchy of a CS club, how to form a CS club, and how to organize events at Kapilvastu Gyanjyoti Shiksha Sadan. Cosog Nepal concluded the session by opening the Computer Science club at the school.",
      "The participation of over 40 students from classes 8 and 10 really motivated us to work more on this kind of project. We are so thankful to the school administration and all students."
    ],
    "date": "26th June 2024",
    "images": [
      "/assets/images/Events/Kapilvastu_Gyanjyoti_Secondary_School/photo1.jpg",
      "/assets/images/Events/Kapilvastu_Gyanjyoti_Secondary_School/photo2.jpg",
      "/assets/images/Events/Kapilvastu_Gyanjyoti_Secondary_School/photo3.jpg"
    ]
  },
  {
    "id": "16",
    "title": "Git, GitHub and GitHub Education session at Kalika Manavgyan School, Butwal",
    "descriptions": [
      "On the 16th of August, Coding for Social Good Nepal organized an in-depth session where we explored different topics such as Git, GitHub, GitHub Student Developer Pack, GitHub Copilot, Domain, Hosting, and hackathon.",
      "We loved the enthusiasm shown by the Computer Engineering Students of Kalika Manavgyan School Butwal. The event was attended by over 200 students studying in 9th, 10th, 11th, and 12th grade. During the session, we also distributed GitHub Stickers and Cheat Sheets provided by GitHub Education.",
      "We thank our executive members and faculty at Kalika Manavagyan Secondary School, Butwal who made this session possible."
    ],
    "date": "16th August 2024",
    "images": [
      "/assets/images/Events/GitHub_Education_Kalika/photo1.jpg",
      "/assets/images/Events/GitHub_Education_Kalika/photo2.jpg",
      "/assets/images/Events/GitHub_Education_Kalika/photo3.jpg"
    ]
  },
  {
    "id": "17",
    "title": "Day 1: Computer Science awareness session at Arniko School",
    "descriptions": [
      "On the 25th of August 2024, Our Biratnagar team shared the opportunities in the field of Computer Science💻 in Nepal. Furthermore, they discussed the hierarchy of a CS club, how to form a CS club, and how to organize events at Arniko Awasiya Secondary School, Biratnagar.",
      "It was a great success with over 50 students from classes 8 and 9. We also had a great Q&A session with the students.",
      "We thank our executive members Mr. Prajwal Das and Ms. Prakriti Mishra and faculty at Arniko Secondary School Biratnagar who made it possible."
    ],
    "date": "25th August 2024",
    "images": [
      "/assets/images/Events/Arniko_School_Day_1/photo1.jpg",
      "/assets/images/Events/Arniko_School_Day_1/photo2.jpg",
      "/assets/images/Events/Arniko_School_Day_1/photo3.jpeg"
    ]
  },
  {
    "id": "18",
    "title": "Day 2: Sharing Opportunities in Computer Science at Arniko School, Biratnagar",
    "descriptions": [
      "On the 29th of August 2024, Mr. Prajwal and Ms. Prakriti shared the opportunities in the field of Computer Science in Nepal.",
      "The participation of over 40 students from class 10 really motivated us to work more on this kind of project. We are so thankful to the school administration and all students."
    ],
    "date": "29th August 2024",
    "images": [
      "/assets/images/Events/Arniko_School_Day_2/photo1.jpg",
      "/assets/images/Events/Arniko_School_Day_2/photo2.jpeg",
      "/assets/images/Events/Arniko_School_Day_2/photo3.jpg"
    ]
  }
]
